#############################################################################
##
#W  examples.xml
#Y  Copyright (C) 2019                              Murray T. Whyte
##
##  Licensing information can be found in the README file of this package.
##
#############################################################################
##

<#GAPDoc Label="EmptyDigraph">
<ManSection>
  <Oper Name="EmptyDigraph" Arg="[filt, ]n"/>
  <Oper Name="NullDigraph" Arg="[filt, ]n"/>
  <Returns>A digraph.</Returns>
  <Description>
    If <A>n</A> is a non-negative integer, this function returns the
    <E>empty</E> or <E>null</E> digraph with <A>n</A> vertices. An empty
    digraph is one with no edges.
    <P/>
      
    If the optional first argument <A>filt</A> is present, then this should
    specify the category or representation the digraph being created will
    belong to. For example, if <A>filt</A> is <Ref Filt="IsMutableDigraph"/>,
    then the digraph being created will be mutable, if <A>filt</A> is <Ref
    Filt="IsImmutableDigraph"/>, then the digraph will be immutable. 
    If the optional first argument <A>filt</A> is not present, then <Ref
      Filt="IsImmutableDigraph"/> is used by default.<P/>

    <C>NullDigraph</C> is a synonym for <C>EmptyDigraph</C>.

    <Example><![CDATA[
gap> EmptyDigraph(20);
<immutable empty digraph with 20 vertices>
gap> NullDigraph(10);
<immutable empty digraph with 10 vertices>
gap> EmptyDigraph(IsMutableDigraph, 10);
<mutable empty digraph with 10 vertices>]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="CompleteBipartiteDigraph">
<ManSection>
  <Oper Name="CompleteBipartiteDigraph" Arg="[filt, ]m, n"/>
  <Returns>A digraph.</Returns>
  <Description>
    A complete bipartite digraph is a digraph whose vertices
    can be partitioned into two non-empty vertex sets, such there exists
    a unique edge with source <C>i</C> and range <C>j</C> if and only if
    <C>i</C> and <C>j</C> lie in different vertex sets. <P/>

    If <A>m</A> and <A>n</A> are positive integers, this function
    returns the complete bipartite digraph with vertex sets of sizes
    <A>m</A> (containing the vertices <C>[1 .. m]</C>) and
    <A>n</A> (containing the vertices <C>[m + 1 .. m + n]</C>).
    <P/>

    If the optional first argument <A>filt</A> is present, then this should
    specify the category or representation the digraph being created will
    belong to. For example, if <A>filt</A> is <Ref Filt="IsMutableDigraph"/>,
    then the digraph being created will be mutable, if <A>filt</A> is <Ref
    Filt="IsImmutableDigraph"/>, then the digraph will be immutable. 
    If the optional first argument <A>filt</A> is not present, then <Ref
      Filt="IsImmutableDigraph"/> is used by default.

    <Example><![CDATA[
gap> CompleteBipartiteDigraph(2, 3);
<immutable complete bipartite digraph with bicomponent sizes 2 and 3>
gap> CompleteBipartiteDigraph(IsMutableDigraph, 3, 2);
<mutable digraph with 5 vertices, 12 edges>
]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="CompleteMultipartiteDigraph">
  <ManSection>
    <Oper Name="CompleteMultipartiteDigraph" Arg = "[filt, ]orders"/>
    <Returns>A digraph.</Returns>
    <Description>
      For a list <A>orders</A> of <C>n</C> positive integers,
      this function returns the digraph containing <C>n</C> independent sets
      of vertices of orders <C>[<A>l</A>[1] .. <A>l</A>[n]]</C>. Moreover,
      each vertex is adjacent to every other not contained in the
      same independent set.
      <P/>

      If the optional first argument <A>filt</A> is present, then this should
      specify the category or representation the digraph being created will
      belong to. For example, if <A>filt</A> is <Ref Filt="IsMutableDigraph"/>,
      then the digraph being created will be mutable, if <A>filt</A> is <Ref
      Filt="IsImmutableDigraph"/>, then the digraph will be immutable. 
      If the optional first argument <A>filt</A> is not present, then <Ref
        Filt="IsImmutableDigraph"/> is used by default.
      <Example><![CDATA[
gap> CompleteMultipartiteDigraph([5, 4, 2]);
<immutable complete multipartite digraph with 11 vertices, 76 edges>
gap> CompleteMultipartiteDigraph(IsMutableDigraph, [5, 4, 2]);
<mutable digraph with 11 vertices, 76 edges>
]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="CompleteDigraph">
<ManSection>
  <Oper Name="CompleteDigraph" Arg="[filt, ]n"/>
  <Returns>A digraph.</Returns>
  <Description>
    If <A>n</A> is a non-negative integer, this function returns the complete
    digraph with <A>n</A> vertices. See <Ref Prop="IsCompleteDigraph"/>. <P/>

    If the optional first argument <A>filt</A> is present, then this should
    specify the category or representation the digraph being created will
    belong to. For example, if <A>filt</A> is <Ref Filt="IsMutableDigraph"/>,
    then the digraph being created will be mutable, if <A>filt</A> is <Ref
    Filt="IsImmutableDigraph"/>, then the digraph will be immutable. 
    If the optional first argument <A>filt</A> is not present, then <Ref
      Filt="IsImmutableDigraph"/> is used by default.
    <Example><![CDATA[
gap> CompleteDigraph(20);
<immutable complete digraph with 20 vertices>
gap> CompleteDigraph(IsMutableDigraph, 10);
<mutable digraph with 10 vertices, 90 edges>
]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="ChainDigraph">
<ManSection>
  <Oper Name="ChainDigraph" Arg="[filt, ]n"/>
  <Returns>A digraph.</Returns>
  <Description>
    If <A>n</A> is a positive integer, this function returns a chain
    with <A>n</A> vertices and <C><A>n</A> - 1</C> edges.
    Specifically,
    for each vertex <C>i</C> (with <C>i</C> &lt; <C>n</C>), there is a directed
    edge with source <C>i</C> and range <C>i + 1</C>. <P/>

    If the optional first argument <A>filt</A> is present, then this should
    specify the category or representation the digraph being created will
    belong to. For example, if <A>filt</A> is <Ref Filt="IsMutableDigraph"/>,
    then the digraph being created will be mutable, if <A>filt</A> is <Ref
    Filt="IsImmutableDigraph"/>, then the digraph will be immutable. 
    If the optional first argument <A>filt</A> is not present, then <Ref
      Filt="IsImmutableDigraph"/> is used by default.<P/>

    The <Ref Oper="DigraphReflexiveTransitiveClosure"/> of a chain represents a
    total order.
    <Example><![CDATA[
gap> ChainDigraph(42);
<immutable chain digraph with 42 vertices>
gap> ChainDigraph(IsMutableDigraph, 10);
<mutable digraph with 10 vertices, 9 edges>
]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="CycleDigraph">
<ManSection>
  <Oper Name="CycleDigraph" Arg="[filt, ]n"/>
  <Oper Name="DigraphCycle" Arg="[filt, ]n"/>
  <Returns>A digraph.</Returns>
  <Description>
    If <A>n</A> is a positive integer, then these functions return a <E>cycle
    digraph</E> with <A>n</A> vertices and <A>n</A> edges. Specifically,
    for each vertex <C>i</C> (with <C>i</C> &lt; <C>n</C>), there is a directed
    edge with source <C>i</C> and range <C>i + 1</C>. In addition, there is
    an edge with source <C>n</C> and range <C>1</C>. <P/>

    If the optional first argument <A>filt</A> is present, then this should
    specify the category or representation the digraph being created will
    belong to. For example, if <A>filt</A> is <Ref Filt="IsMutableDigraph"/>,
    then the digraph being created will be mutable, if <A>filt</A> is <Ref
    Filt="IsImmutableDigraph"/>, then the digraph will be immutable. 
    If the optional first argument <A>filt</A> is not present, then <Ref
    Filt="IsImmutableDigraph"/> is used by default.
  <Example><![CDATA[
gap> CycleDigraph(1);
<immutable digraph with 1 vertex, 1 edge>
gap> CycleDigraph(123);
<immutable cycle digraph with 123 vertices>
gap> CycleDigraph(IsMutableDigraph, 10);
<mutable digraph with 10 vertices, 10 edges>
gap> DigraphCycle(4) = CycleDigraph(4);
true
]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="JohnsonDigraph">
<ManSection>
  <Oper Name="JohnsonDigraph" Arg="[filt, ]n, k"/>
  <Returns>A digraph.</Returns>
  <Description>
    If <A>n</A> and <A>k</A> are non-negative integers, then this operation
    returns a symmetric digraph which corresponds to the undirected <E>Johnson
    graph</E> <M>J(n, k)</M>. <P/>

    If the optional first argument <A>filt</A> is present, then this should
    specify the category or representation the digraph being created will
    belong to. For example, if <A>filt</A> is <Ref Filt="IsMutableDigraph"/>,
    then the digraph being created will be mutable, if <A>filt</A> is <Ref
    Filt="IsImmutableDigraph"/>, then the digraph will be immutable. 
    If the optional first argument <A>filt</A> is not present, then <Ref
      Filt="IsImmutableDigraph"/> is used by default.<P/>

    The <E>Johnson graph</E> <M>J(n, k)</M> has vertices given by all the
    <A>k</A>-subsets of the range <C>[1 .. <A>n</A>]</C>, and two vertices are
      connected by an edge iff their intersection has size <M><A>k</A> - 1</M>.

    <Example><![CDATA[
gap> gr := JohnsonDigraph(3, 1);
<immutable symmetric digraph with 3 vertices, 6 edges>
gap> OutNeighbours(gr);
[ [ 2, 3 ], [ 1, 3 ], [ 1, 2 ] ]
gap> gr := JohnsonDigraph(4, 2);
<immutable symmetric digraph with 6 vertices, 24 edges>
gap> OutNeighbours(gr);
[ [ 2, 3, 4, 5 ], [ 1, 3, 4, 6 ], [ 1, 2, 5, 6 ], [ 1, 2, 5, 6 ], 
  [ 1, 3, 4, 6 ], [ 2, 3, 4, 5 ] ]
gap> JohnsonDigraph(1, 0);
<immutable empty digraph with 1 vertex>
gap> JohnsonDigraph(IsMutableDigraph, 1, 0);
<mutable empty digraph with 1 vertex>
]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="PetersenGraph">
<ManSection>
  <Oper Name="PetersenGraph" Arg="[filt]"/>
  <Returns>A digraph.</Returns>
  <Description>

    From <URL>https://en.wikipedia.org/wiki/Petersen_graph</URL>:<P/>

    <Q>The Petersen graph is an undirected graph with 10 vertices and 15 edges.
    It is a small graph that serves as a useful example and counterexample for
    many problems in graph theory. The Petersen graph is named after Julius
    Petersen, who in 1898 constructed it to be the smallest bridgeless cubic
    graph with no three-edge-coloring.</Q><P/>
    
    If the optional first argument <A>filt</A> is present, then this should
    specify the category or representation the digraph being created will
    belong to. For example, if <A>filt</A> is <Ref Filt="IsMutableDigraph"/>,
    then the digraph being created will be mutable, if <A>filt</A> is <Ref
    Filt="IsImmutableDigraph"/>, then the digraph will be immutable. 
    If the optional first argument <A>filt</A> is not present, then <Ref
      Filt="IsImmutableDigraph"/> is used by default.<P/>

    See also <Ref Oper="GeneralisedPetersenGraph"/>.

<Example><![CDATA[
gap> ChromaticNumber(PetersenGraph());
3
gap> PetersenGraph(IsMutableDigraph);
<mutable digraph with 10 vertices, 30 edges>
]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="GeneralisedPetersenGraph">
<ManSection>
  <Oper Name="GeneralisedPetersenGraph" Arg="[filt, ]n, k"/>
  <Returns>A digraph.</Returns>
  <Description>
    If <A>n</A> is a positive integer and <A>k</A> is a non-negative
    integer less than <C><A>n</A> / 2</C>, then this operation returns
    the <E>generalised Petersen graph</E> <M>GPG(<A>n</A>, k)</M>. <P/>

    From
    <URL>https://en.wikipedia.org/wiki/Generalized_Petersen_graph</URL>:
    <P/>

    <Q>The generalized Petersen graphs are a family of cubic
    graphs formed by connecting the vertices of a regular polygon to the
    corresponding vertices of a star polygon. They include the Petersen graph
    and generalize one of the ways of constructing the Petersen graph. The
    generalized Petersen graph family was introduced in 1950 by H. S. M.
    Coxeter and was given its name in 1969 by Mark Watkins.</Q>
    <P/>

    If the optional first argument <A>filt</A> is present, then this should
    specify the category or representation the digraph being created will
    belong to. For example, if <A>filt</A> is <Ref Filt="IsMutableDigraph"/>,
    then the digraph being created will be mutable, if <A>filt</A> is <Ref
    Filt="IsImmutableDigraph"/>, then the digraph will be immutable. 
    If the optional first argument <A>filt</A> is not present, then <Ref
      Filt="IsImmutableDigraph"/> is used by default.<P/>

    See also <Ref Oper="PetersenGraph"/>.

<Example><![CDATA[
gap> GeneralisedPetersenGraph(7, 2);
<immutable symmetric digraph with 14 vertices, 42 edges>
gap> GeneralisedPetersenGraph(40, 1);
<immutable symmetric digraph with 80 vertices, 240 edges>
gap> D := GeneralisedPetersenGraph(5, 2);
<immutable symmetric digraph with 10 vertices, 30 edges>
gap> IsIsomorphicDigraph(D, PetersenGraph());
true
gap> GeneralisedPetersenGraph(IsMutableDigraph, 9, 4);
<mutable digraph with 18 vertices, 54 edges>
]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="LollipopGraph">
<ManSection>
  <Oper Name="LollipopGraph" Arg="[filt, ]m, n"/>
  <Returns>A digraph</Returns>
  <Description>
    If <A>m</A> and <A>n</A> are positive integers,
    then this operation returns the <E>(<A>m</A>,<A>n</A>)-lollipop graph</E>.
    As defined at <URL>https://en.wikipedia.org/wiki/Lollipop_graph</URL>,
    this consists of a complete digraph on the vertices <C>[1..<A>m</A>]</C>
    (the 'head' of the lollipop),
    and the symmetric closure of a chain digraph on the remaining <A>n</A>
    vertices (the 'stick'),
    connected by a bridge
    (the edge <C>[<A>m</A>, <A>m</A>+1]</C> and its reverse). <P/>

    If the optional first argument <A>filt</A> is present, then this should
    specify the category or representation the digraph being created will
    belong to. For example, if <A>filt</A> is <Ref Filt="IsMutableDigraph"/>,
    then the digraph being created will be mutable, if <A>filt</A> is <Ref
    Filt="IsImmutableDigraph"/>, then the digraph will be immutable.
    If the optional first argument <A>filt</A> is not present, then <Ref
      Filt="IsImmutableDigraph"/> is used by default.

<Example><![CDATA[
gap> D := LollipopGraph(5, 3);
<immutable connected symmetric digraph with 8 vertices, 26 edges>
gap> CliqueNumber(D);
5
gap> DigraphUndirectedGirth(D);
3
gap> LollipopGraph(IsMutableDigraph, 3, 8);
<mutable digraph with 11 vertices, 22 edges>
]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="GearGraph">
<ManSection>
  <Oper Name="GearGraph" Arg="[filt, ]n"/>
  <Returns>A digraph.</Returns>
  <Description>
    If <A>n</A> is a positive integer at least 3, then this operation
    returns the <E>gear graph</E> with <M>2n + 1</M> vertices and
    <M>3n</M> undirected edges. The <M>n</M>th gear graph is the <M>2n</M>th
    cycle graph with one additional central vertex, to which every other
    vertex of the cycle is connected. The gear graph is a symmetric digraph.
    A gear graph is a Matchstick graph, that is it is simple with a planar
    graph embedding, and is a unit-distance graph (that is, it can be embedded
    into the Euclidean plane with vertices being distinct points and edges
    having length 1).<P/>

    If the optional first argument <A>filt</A> is present, then this should
    specify the category or representation the digraph being created will
    belong to. For example, if <A>filt</A> is <Ref Filt="IsMutableDigraph"/>,
    then the digraph being created will be mutable, if <A>filt</A> is <Ref
    Filt="IsImmutableDigraph"/>, then the digraph will be immutable. 
    If the optional first argument <A>filt</A> is not present, then <Ref
    Filt="IsImmutableDigraph"/> is used by default.<P/>

    See <URL>https://mathworld.wolfram.com/GearGraph.html</URL> for further
    details. 

<Example><![CDATA[
gap> D := GearGraph(4);
<immutable symmetric digraph with 9 vertices, 24 edges>
gap> ChromaticNumber(D);
2
gap> IsVertexTransitive(D);
false]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="KingsGraph">
<ManSection>
  <Oper Name="KingsGraph" Arg="[filt, ]n, k"/>
  <Returns>A digraph.</Returns>
  <Description>
    If <A>n</A> and <A>k</A> are positive integers,
    then this operation returns
    the <E>king's graph</E> for an <A>n</A> by <A>k</A> board. <P/>

    From
    <URL>https://en.wikipedia.org/wiki/King%27s_graph</URL>:
    <P/>

    <Q>In graph theory, a king's graph is a graph that represents all legal 
    moves of the king chess piece on a chessboard where each vertex represents 
    a square on a chessboard and each edge is a legal move. More specifically, 
    an <A>n</A> by <A>k</A> king's graph is a king's graph of an <A>n</A> by
    <A>k</A> chessboard. It is the map graph formed from the squares of a chessboard 
    by making a vertex for each square and an edge for each two squares that 
    share an edge or a corner. It can also be constructed as the strong product 
    of two path graphs.</Q>
    <P/>
    
    In particular, the <C><A>n</A> * <A>k</A></C>  vertices can be arranged
    into an <A>n</A> by <A>k</A> grid such that two vertices are adjacent in
    the digraph if and only if they are orthogonally or diagonally adjacent in the grid.
    The correspondence between vertices and grid positions is given by
    <Ref Oper="DigraphVertexLabels"/>.  <P/>
    
    See also <Ref Oper="SquareGridGraph"/> and
    <Ref Oper="TriangularGridGraph"/>. <P/>
    
    If the optional first argument <A>filt</A> is present, then this should
    specify the category or representation the digraph being created will
    belong to. For example, if <A>filt</A> is <Ref Filt="IsMutableDigraph"/>,
    then the digraph being created will be mutable, if <A>filt</A> is <Ref
    Filt="IsImmutableDigraph"/>, then the digraph will be immutable.
    If the optional first argument <A>filt</A> is not present, then <Ref
      Filt="IsImmutableDigraph"/> is used by default.<P/>
    
    <Example><![CDATA[
gap> KingsGraph(8, 8);
<immutable connected symmetric digraph with 64 vertices, 420 edges>
gap> D := KingsGraph(IsMutable, 2, 7);
<mutable digraph with 14 vertices, 62 edges>
gap> IsPlanarDigraph(D);
true
gap> D := KingsGraph(3, 3);
<immutable connected symmetric digraph with 9 vertices, 40 edges>
gap> OutNeighbors(D);
[ [ 2, 4, 5 ], [ 1, 3, 5, 4, 6 ], [ 2, 6, 5 ], [ 5, 1, 7, 2, 8 ], 
  [ 4, 6, 2, 8, 3, 7, 1, 9 ], [ 5, 3, 9, 8, 2 ], [ 8, 4, 5 ], 
  [ 7, 9, 5, 6, 4 ], [ 8, 6, 5 ] ]
]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="PrismGraph">
<ManSection>
  <Oper Name="PrismGraph" Arg="[filt, ]n"/>
  <Returns>A digraph.</Returns>
  <Description>
    If <A>n</A> is a positive integer at least 3, then this operation returns
    the <E>prism graph</E> that is the skeleton of the <M>n</M>-prism. It has
    <M>2n</M> vertices and <M>3n</M> undirected edges. The Prism graph is a
    symmetric digraph. The <M>n</M>th prism graph is isomorphic to the graph
    Cartesian product of the <M>2</M>nd Path graph and the <M>n</M>th cycle
    graph, isomorphic to the generalised Petersen graph <M>GP(n,1)</M>. If
    <M>n</M> is odd then the prism graph is isomorphic to the Circulant graph
    <M>Ci(2n, [2,n])</M>. The prism graph is Hamiltonian.<P/>

    If the optional first argument <A>filt</A> is present, then this should
    specify the category or representation the digraph being created will
    belong to. For example, if <A>filt</A> is <Ref Filt="IsMutableDigraph"/>,
    then the digraph being created will be mutable, if <A>filt</A> is <Ref
    Filt="IsImmutableDigraph"/>, then the digraph will be immutable. 
    If the optional first argument <A>filt</A> is not present, then <Ref
    Filt="IsImmutableDigraph"/> is used by default.<P/>

    See <URL>https://mathworld.wolfram.com/PrismGraph.html</URL> for further
    details. 

<Example><![CDATA[
gap> D := PrismGraph(4);
<immutable symmetric digraph with 8 vertices, 24 edges>
gap> IsHamiltonianDigraph(D);
true
gap> D := PrismGraph(5);
<immutable symmetric digraph with 10 vertices, 30 edges>
gap> IsIsomorphicDigraph(D, CirculantGraph(10, [2, 5]));
true]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="MobiusLadderGraph">
<ManSection>
  <Oper Name="MobiusLadderGraph" Arg="[filt, ]n"/>
  <Returns>A digraph.</Returns>
  <Description>
    If <A>n</A> is a positive integer at least 4, then this operation returns
    the <E>Mobius ladder graph</E> that is obtained by introducing a 'twist'
    in the <M>n</M>th prism graph, similar to the construction of a Mobius
    strip. The Mobius ladder graph is isomorphic to the circulant graph
    <M>Ci(2n, [1, n])</M>. The Mobius ladders are cubic, symmetric,
    Hamiltonian, vertex-transitive, and graceful. They are also non-planar
    and apex, meaning removing a single vertex produces a planar graph.<P/>

    If the optional first argument <A>filt</A> is present, then this should
    specify the category or representation the digraph being created will
    belong to. For example, if <A>filt</A> is <Ref Filt="IsMutableDigraph"/>,
    then the digraph being created will be mutable, if <A>filt</A> is <Ref
    Filt="IsImmutableDigraph"/>, then the digraph will be immutable. 
    If the optional first argument <A>filt</A> is not present, then <Ref
    Filt="IsImmutableDigraph"/> is used by default.<P/>

    See <URL>https://mathworld.wolfram.com/MoebiusLadder.html</URL> for further
    details. 

<Example><![CDATA[
gap> D := MobiusLadderGraph(7);
<immutable symmetric digraph with 14 vertices, 42 edges>
gap> IsHamiltonianDigraph(D);
true
gap> IsVertexTransitive(D);
true
gap> IsPlanarDigraph(D);
false
gap> D2 := DigraphRemoveVertex(D, 1);
<immutable digraph with 13 vertices, 36 edges>
gap> IsPlanarDigraph(D2);
true]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="SquareGridGraph">
<ManSection>
  <Oper Name="SquareGridGraph" Arg="[filt, ]n, k"/>
  <Oper Name="GridGraph" Arg="[filt, ]n, k"/>
  <Returns>A digraph.</Returns>
  <Description>
    If <A>n</A> and <A>k</A> are positive integers, then this operation returns
    a square grid graph of dimension <A>n</A> by <A>k</A>. <P/>

    A <E>square grid graph</E> of dimension <A>n</A> by <A>k</A> is the
    <Ref Func="DigraphCartesianProduct"
      Label="for a positive number of digraphs" /> of the
    symmetric closures of the chain digraphs with <A>n</A> and <A>k</A>
    vertices; see <Ref Oper="DigraphSymmetricClosure"/> and
    <Ref Oper="ChainDigraph"/>.  <P/>

    In particular, the <C><A>n</A> * <A>k</A></C>  vertices can be arranged
    into an <A>n</A> by <A>k</A> grid such that two vertices are adjacent in
    the digraph if and only if they are orthogonally adjacent in the grid.
    The correspondence between vertices and grid positions is given by
    <Ref Oper="DigraphVertexLabels"/>.  <P/>

    See <URL>https://en.wikipedia.org/wiki/Lattice_graph</URL>
    for more information.  <P/>

    If the optional first argument <A>filt</A> is present, then this should
    specify the category or representation the digraph being created will
    belong to. For example, if <A>filt</A> is <Ref Filt="IsMutableDigraph"/>,
    then the digraph being created will be mutable, if <A>filt</A> is <Ref
    Filt="IsImmutableDigraph"/>, then the digraph will be immutable.
    If the optional first argument <A>filt</A> is not present, then <Ref
      Filt="IsImmutableDigraph"/> is used by default.<P/>
    
<Example><![CDATA[
gap> SquareGridGraph(5, 5);
<immutable connected bipartite symmetric digraph with bicomponent size\
s 13 and 12>
gap> GridGraph(IsMutable, 3, 4);
<mutable digraph with 12 vertices, 34 edges>
]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="WalshHadamardGraph">
<ManSection>
  <Oper Name="WalshHadamardGraph" Arg="[filt, ]n"/>
  <Returns>A digraph.</Returns>
  <Description>
    If <A>n</A> is a positive integer at least 1, then this operation returns
    the <E>Hadamard graph</E> constructed from the <M>n</M>th Hadamard matrix
    (of dimension <M>2^n</M>) as constructed by Joseph Walsh. A Hadamard matrix
    is a square matrix with entries either 1 or -1, such that all the rows are
    mutually orthogonal. The <M>n</M>th Walsh Hadamard graph is a graph on
    <M>4n</M> matrices split into four categories <M>r_i+, r_i-, c_i+, c_i-</M>.
    If <M>h_ij</M> are the elements of the <M>n</M>th Walsh matrix, then if
    <M>h_ij = 1</M> then <M>(r_i+, c_j+)</M> and <M>(r_i-, c_j-)</M> are edges,
    if <M>h_ij = -1</M> then <M>(r_i+, c_j-)</M> and <M>(r_i-, c_j+)</M> are
    edges. Walsh Hadamard graphs are distance transitive and distance
    regular.<P/>

    If the optional first argument <A>filt</A> is present, then this should
    specify the category or representation the digraph being created will
    belong to. For example, if <A>filt</A> is <Ref Filt="IsMutableDigraph"/>,
    then the digraph being created will be mutable, if <A>filt</A> is <Ref
    Filt="IsImmutableDigraph"/>, then the digraph will be immutable. 
    If the optional first argument <A>filt</A> is not present, then <Ref
    Filt="IsImmutableDigraph"/> is used by default.<P/>

    See <URL>https://mathworld.wolfram.com/HadamardGraph.html</URL> for further
    details. 

<Example><![CDATA[
gap> D := WalshHadamardGraph(5);
<immutable symmetric digraph with 64 vertices, 1024 edges>
gap> IsDistanceRegularDigraph(D);
true]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="HalvedCubeGraph">
<ManSection>
  <Oper Name="HalvedCubeGraph" Arg="[filt, ]n"/>
  <Returns>A digraph.</Returns>
  <Description>
    If <A>n</A> is a positive integer at least 1, then this operation returns
    the <M>n</M>th <E>halved cube graph</E>, the graph of the <M>n</M>-
    demihypercube. The vertices of the graph are those of the <M>n</M>th-
    hypercube, with two vertices adjacent if and only if they are at distance
    1 or 2 from each other. Equivalent constructions are as the second graph
    power of the <M>n-1</M>th hypercube graph, or as with vertices labelled as
    the binary numbers where two vertices are adjacent if they differ in a
    single bit, or with vertices labelled with the subset of binary numbers 
    with even Hamming weight, with edges connecting vertices with Hamming
    distance exactly 2. The Halved Cube graph is distance regular and contains
    a Hamiltonian cycle.<P/>

    If the optional first argument <A>filt</A> is present, then this should
    specify the category or representation the digraph being created will
    belong to. For example, if <A>filt</A> is <Ref Filt="IsMutableDigraph"/>,
    then the digraph being created will be mutable, if <A>filt</A> is <Ref
    Filt="IsImmutableDigraph"/>, then the digraph will be immutable. 
    If the optional first argument <A>filt</A> is not present, then <Ref
    Filt="IsImmutableDigraph"/> is used by default.<P/>

    See <URL>https://mathworld.wolfram.com/HalvedCubeGraph.html</URL> for
    further details. 

<Example><![CDATA[
gap> D := HalvedCubeGraph(3);
<immutable Hamiltonian connected symmetric digraph with 4 vertices, 12\
 edges>
gap> IsDistanceRegularDigraph(D);
true
gap> IsHamiltonianDigraph(D);
true]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="WheelGraph">
<ManSection>
  <Oper Name="WheelGraph" Arg="[filt, ]n"/>
  <Returns>A digraph.</Returns>
  <Description>
    If <A>n</A> is a positive integer at least 4, then this operation returns
    the <M>n</M>th <E>wheel graph</E>. The Wheel graph is formed from an
    <M>n-1</M> cycle graph with a single additional vertex adjacent to all
    vertices of the cycle. The graph has <M>n</M> vertices and <M>2(n-1)</M>
    edges. Wheel graphs are the skeletons of <M>n-1</M> pyramids, and are
    self-dual. If <M>n</M> is odd, then the chromatic number of the wheel
    graph is 3 and the Wheel graph is perfect, and it is 4 otherwise. The
    wheel graph is also Hamiltonian and planar.<P/>

    If the optional first argument <A>filt</A> is present, then this should
    specify the category or representation the digraph being created will
    belong to. For example, if <A>filt</A> is <Ref Filt="IsMutableDigraph"/>,
    then the digraph being created will be mutable, if <A>filt</A> is <Ref
    Filt="IsImmutableDigraph"/>, then the digraph will be immutable. 
    If the optional first argument <A>filt</A> is not present, then <Ref
    Filt="IsImmutableDigraph"/> is used by default.<P/>

    See <URL>https://mathworld.wolfram.com/WheelGraph.html</URL> for further
    details. 

<Example><![CDATA[
gap> D := WheelGraph(8);
<immutable Hamiltonian connected symmetric digraph with 8 vertices, 28\
 edges>
gap> ChromaticNumber(D);
4
gap> IsHamiltonianDigraph(D);
true]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="TriangularGridGraph">
<ManSection>
  <Oper Name="TriangularGridGraph" Arg="[filt, ]n, k"/>
  <Returns>A digraph.</Returns>
  <Description>
    If <A>n</A> and <A>k</A> are positive integers, then this operation returns
    a triangular grid graph of dimension <A>n</A> by <A>k</A>. <P/>

    A <E>triangular grid graph</E> of dimension <A>n</A> by <A>k</A> is a
    symmetric digraph constructed from the <Ref Oper="SquareGridGraph"/> of the
    same dimensions, where additionally two vertices are adjacent in the digraph
    if they are diagonally adjacent in the grid, on a particular one of the
    diagonals.
    The correspondence between vertices and grid positions is given by <Ref
      Oper="DigraphVertexLabels"/>.
    More specifically, the particular diagonal is the one such that,
    the vertices corresponding to the grid positions <C>[2,1]</C> and
    <C>[1,2]</C> are adjacent (if they exist),
    but those corresponding to <C>[1,1]</C> and <C>[2,2]</C> are not. <P/>

    See <URL>https://en.wikipedia.org/wiki/Lattice_graph#Other_kinds</URL>
    for more information.  <P/>
    
    If the optional first argument <A>filt</A> is present, then this should
    specify the category or representation the digraph being created will
    belong to. For example, if <A>filt</A> is <Ref Filt="IsMutableDigraph"/>,
    then the digraph being created will be mutable, if <A>filt</A> is <Ref
    Filt="IsImmutableDigraph"/>, then the digraph will be immutable.
    If the optional first argument <A>filt</A> is not present, then <Ref
      Filt="IsImmutableDigraph"/> is used by default.<P/>

<Example><![CDATA[
gap> TriangularGridGraph(3, 3);
<immutable connected symmetric digraph with 9 vertices, 32 edges>
gap> TriangularGridGraph(IsMutable, 3, 3);
<mutable digraph with 9 vertices, 32 edges>
]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="HypercubeGraph">
<ManSection>
  <Oper Name="HypercubeGraph" Arg="[filt, ]n"/>
  <Returns>A digraph.</Returns>
  <Description>
    If <A>n</A> is a non-negative integer, then this operation returns the
    <M>n</M>th <E>hypercube graph</E>. The graph has <M>2^n</M> vertices and
    <M>2^(n-1)n</M> edges. It is formed from the vertices and edges of the 
    <M>n</M>-dimensional hypercube. Alternatively, the graph can be constructed
    by labelling each vertex with the binary numbers, with two vertices 
    adjacent if they have Hamming distance exactly one. The hypercube graphs
    are Hamiltonian, distance-transitive and therefore distance-regular, and
    bipartite.<P/>

    If the optional first argument <A>filt</A> is present, then this should
    specify the category or representation the digraph being created will
    belong to. For example, if <A>filt</A> is <Ref Filt="IsMutableDigraph"/>,
    then the digraph being created will be mutable, if <A>filt</A> is <Ref
    Filt="IsImmutableDigraph"/>, then the digraph will be immutable. 
    If the optional first argument <A>filt</A> is not present, then <Ref
    Filt="IsImmutableDigraph"/> is used by default.<P/>

    See <URL>https://mathworld.wolfram.com/HypercubeGraph.html</URL> for further
    details. 

<Example><![CDATA[
gap> D := HypercubeGraph(5);
<immutable Hamiltonian connected bipartite symmetric digraph with bico\
mponent sizes 16 and 16>
]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="StarDigraph">
<ManSection>
  <Oper Name="StarDigraph" Arg="[filt, ]k"/>
  <Returns>A digraph.</Returns>
  <Description>
    If <A>k</A> is a positive integer, then this operation returns the
    <E>star digraph</E> with <A>k</A> vertices, which is the
    undirected tree in which vertex <C>1</C> is adjacent to all other
    vertices.  If <A>k</A> is at least <C>2</C>, then this is the complete
    bipartite digraph with bicomponents
    <C>[1]</C> and <C>[2 .. <A>k</A>]</C>. <P/>
    
    See <Ref Prop="IsUndirectedTree"/>, <Ref Prop="IsCompleteBipartiteDigraph"/>,
    and <Ref Attr="DigraphBicomponents"/>. <P/>

    If the optional first argument <A>filt</A> is present, then this should
    specify the category or representation the digraph being created will
    belong to. For example, if <A>filt</A> is <Ref Filt="IsMutableDigraph"/>,
    then the digraph being created will be mutable, if <A>filt</A> is <Ref
    Filt="IsImmutableDigraph"/>, then the digraph will be immutable. 
    If the optional first argument <A>filt</A> is not present, then <Ref
      Filt="IsImmutableDigraph"/> is used by default.<P/>
    <Example><![CDATA[
gap> StarDigraph(IsMutable, 10);
<mutable digraph with 10 vertices, 18 edges>
gap> StarDigraph(5);
<immutable complete bipartite digraph with bicomponent sizes 1 and 4>
gap> IsSymmetricDigraph(StarDigraph(3));
true
gap> IsUndirectedTree(StarDigraph(3));
true
]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="LindgrenSousselierGraph">
<ManSection>
  <Oper Name="LindgrenSousselierGraph" Arg="[filt, ]n"/>
  <Returns>A digraph.</Returns>
  <Description>
    If <A>n</A> is an integer greater than 0, then this operation returns the
    <M>n</M>th <E>Lindgren-Sousselier graph</E>, an infinite family of
    hyophamiltonian graphs - a graph that is non-Hamiltonian but removing
    any vector gives a Hamiltonian graph. The graph has <M>6n+4</M> vertices
    and <M>15 + 10(n-1)</M> undirected edges. The first Lindgren-Sousselier
    graph is the Petersen graph, and is in fact the smallest hyophamiltonian 
    graph.<P/>

    If the optional first argument <A>filt</A> is present, then this should
    specify the category or representation the digraph being created will
    belong to. For example, if <A>filt</A> is <Ref Filt="IsMutableDigraph"/>,
    then the digraph being created will be mutable, if <A>filt</A> is <Ref
    Filt="IsImmutableDigraph"/>, then the digraph will be immutable. 
    If the optional first argument <A>filt</A> is not present, then <Ref
    Filt="IsImmutableDigraph"/> is used by default.<P/>

    See <URL>https://mathworld.wolfram.com/HypohamiltonianGraph.html</URL> for further
    details. 

<Example><![CDATA[
gap> D := LindgrenSousselierGraph(3);
<immutable symmetric digraph with 22 vertices, 70 edges>
gap> IsHamiltonianDigraph(D);
false
gap> IsHamiltonianDigraph(DigraphRemoveVertex(D, 1));
true
gap> IsIsomorphicDigraph(LindgrenSousselierGraph(1), PetersenGraph());
true]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="KneserGraph">
<ManSection>
  <Oper Name="KneserGraph" Arg="[filt, ]n, k"/>
  <Returns>A digraph.</Returns>
  <Description>
    If <A>n</A> and <A>k</A> are integers greater than 0, with <M>k</M> less
    than <M>n</M>, then this operation returns the <M>(n,k)</M>th
    <E>Kneser graph</E>. The Kneser graph's vertices correspond to the <M>k</M>-
    element subsets of a set of <M>n</M> elements, with two vertices being
    adjacent if and only if the subsets are disjoint. The graph has 
    <M>Binomial(n, k)</M> vertices and <M>(1/2) * Binomial(n, k) *
    Binomial(n - k, k)</M> edges. Kneser graphs are regular, edge transitive,
    and vertex transitive. If <M>k</M> is 1, then the graph is the complete
    graph on <M>n</M> vertices. If <M>(n, k)</M> is <M>(2m - 1, n -1)</M>, then
    the graph is the <M>m</M>th Odd graph. The Petersen graph is the
    <M>(5, 2)</M>th Kneser graph.<P/>

    If <M>n >= 2k</M> then the graph's chromatic number is <M>n - 2k + 2</M>,
    and otherwise is 1. The Kneser graph contains a Hamiltonian cycle if 
    <M>n >= ((3 + 5 ^ 0.5) / 2)k + 1</M>. The graph has clique number equal to
    the floor of <M>n / k</M>.<P/>

    If the optional first argument <A>filt</A> is present, then this should
    specify the category or representation the digraph being created will
    belong to. For example, if <A>filt</A> is <Ref Filt="IsMutableDigraph"/>,
    then the digraph being created will be mutable, if <A>filt</A> is <Ref
    Filt="IsImmutableDigraph"/>, then the digraph will be immutable. 
    If the optional first argument <A>filt</A> is not present, then <Ref
    Filt="IsImmutableDigraph"/> is used by default.<P/>

    See <URL>https://mathworld.wolfram.com/KneserGraph.html</URL> for further
    details. 

<Example><![CDATA[
gap> D := KneserGraph(7, 3);
<immutable edge- and vertex-transitive symmetric digraph with 35 verti\
ces, 140 edges>
gap> IsRegularDigraph(D);
true
gap> ChromaticNumber(D);
3
gap> CliqueNumber(D);
2]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="KnightsGraph">
<ManSection>
  <Oper Name="KnightsGraph" Arg="[filt, ]m, n"/>
  <Returns>A digraph.</Returns>
  <Description>
    If <A>m</A> and <A>n</A> are both positive integers, then this operation
    returns the <E>Knight's Graph</E> for a <A>m</A> by <A>n</A> board. <P/>

    From
    <URL>https://en.wikipedia.org/wiki/Knight%27s_graph</URL>:
    <P/>

    <Q>In graph theory, a knight's graph, or a knight's tour graph, is a
    graph that represents all legal moves of the knight chess piece on a
    chessboard.  Each vertex of this graph represents a square of the
    chessboard, and each edge connects two squares that are a knight's move
    apart from each other. More specifically, an <A>m</A> by <A>n</A> knight's
    graph is a knight's graph of an <A>m</A> by <A>n</A> chessboard.</Q>
    <P/>

    If the optional first argument <A>filt</A> is present, then this should
    specify the category or representation the digraph being created will
    belong to. For example, if <A>filt</A> is <Ref Filt="IsMutableDigraph"/>,
    then the digraph being created will be mutable, if <A>filt</A> is <Ref
    Filt="IsImmutableDigraph"/>, then the digraph will be immutable.
    If the optional first argument <A>filt</A> is not present, then <Ref
      Filt="IsImmutableDigraph"/> is used by default.<P/>

<Example><![CDATA[
gap> D := KnightsGraph(8, 8);
<immutable connected symmetric digraph with 64 vertices, 336 edges>
gap> IsConnectedDigraph(D);
true
gap> D := KnightsGraph(3, 3);
<immutable symmetric digraph with 9 vertices, 16 edges>
gap> IsConnectedDigraph(D);
false
gap> KnightsGraph(IsMutable, 3, 9);
<mutable digraph with 27 vertices, 88 edges>
]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="MycielskiGraph">
<ManSection>
  <Oper Name="MycielskiGraph" Arg="[filt, ]n"/>
  <Returns>A digraph.</Returns>
  <Description>
    If <A>n</A> is an integer greater than 1, then this operation returns the
    <M>n</M>th <E>Mycielski graph</E>. The Mycielskian of a triangle-free graph 
    is a construction that adds vertices and edges to produce a new graph that
    is still triangle-free but has a larger chromatic number. The Mycielski
    graphs are a series of graphs with this construction repeated, starting
    with the complete graph on two vertices. The graph has <M>3 * 2^(n-2) -1</M>
    vertices, with the number of edges being
    <M>(18 - 27 * 2 ^ n + 14 * 3 ^ n) / 36</M>.<P/>

    The Mycielski graph has chromatic number equal to <M>n</M>, clique number 
    equal to <M>2</M>, and is Hamiltonian. The graph is in fact the graph with 
    chromatic number <M>n</M> with the least possible vertices.<P/>

    If the optional first argument <A>filt</A> is present, then this should
    specify the category or representation the digraph being created will
    belong to. For example, if <A>filt</A> is <Ref Filt="IsMutableDigraph"/>,
    then the digraph being created will be mutable, if <A>filt</A> is <Ref
    Filt="IsImmutableDigraph"/>, then the digraph will be immutable. 
    If the optional first argument <A>filt</A> is not present, then <Ref
    Filt="IsImmutableDigraph"/> is used by default.<P/>

    See <URL>https://mathworld.wolfram.com/MycielskiGraph.html</URL> for further
    details. 

<Example><![CDATA[
gap> D := MycielskiGraph(4);
<immutable Hamiltonian connected symmetric digraph with 11 vertices, 4\
0 edges>
gap> ChromaticNumber(D);
4
gap> CliqueNumber(D);
2]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="OddGraph">
<ManSection>
  <Oper Name="OddGraph" Arg="[filt, ]n"/>
  <Returns>A digraph.</Returns>
  <Description>
    If <A>n</A> is an integer greater than 0, then this operation returns the
    <M>n</M>th <E>odd graph</E>. The odd graph has vertices labelled with the 
    <M>n - 1</M>-subsets of a <M>2n - 1</M>-set, with two vertices adjacent if 
    and only if their subsets are disjoint. The <M>n</M>th odd graph is the 
    <M>(2n - 1, n - 1)</M>th Kneser graph. The graph has
    <M>Binomial(2n - 1, n -1)</M> vertices and
    <M>n * Binomial(2n - 1, n - 1) / 2</M> edges.<P/>

    The odd graph is regular and distance transitive (and therefore distance
    regular). They have chromatic number equal to 3, and all Odd graphs with
    <M>n</M> greater than 3 are Hamiltonian. They are also vertex and edge
    transitive.<P/>

    If the optional first argument <A>filt</A> is present, then this should
    specify the category or representation the digraph being created will
    belong to. For example, if <A>filt</A> is <Ref Filt="IsMutableDigraph"/>,
    then the digraph being created will be mutable, if <A>filt</A> is <Ref
    Filt="IsImmutableDigraph"/>, then the digraph will be immutable. 
    If the optional first argument <A>filt</A> is not present, then <Ref
    Filt="IsImmutableDigraph"/> is used by default.<P/>

    See <URL>https://mathworld.wolfram.com/OddGraph.html</URL> for further
    details. 

<Example><![CDATA[
gap> D := OddGraph(4);
<immutable edge- and vertex-transitive symmetric digraph with 35 verti\
ces, 140 edges>
gap> IsIsomorphicDigraph(D, KneserGraph(7, 3));
true
gap> ChromaticNumber(D);
3]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="HaarGraph">
<ManSection>
  <Oper Name="HaarGraph" Arg="[filt, ]n"/>
  <Returns>A digraph.</Returns>
  <Description>
    If <A>n</A> is a positive integer then this operation returns
    the <E>Haar graph</E> <M>H(<A>n</A>)</M>. <P/>

    From
    <URL>https://mathworld.wolfram.com/HaarGraph.html</URL>:
    <P/>

    <Q>A Haar graph H(<A>n</A>) is a bipartite regular vertex-transitive graph
    indexed by a positive integer and obtained by a simple binary encoding of
    cyclically adjacent vertices. Haar graphs may be connected or
    disconnected.</Q><P/>

    The number of vertices in the Haar graph <M>H(<A>n</A>)</M> is
    equal to twice <M>m</M>, where <M>m</M> is the number of digits
    required to represent <A>n</A> in binary.
    These vertices are arranged into bicomponents
    <C>[1..m]</C> and <C>[m+1..2*m]</C>.
    Vertices <M>i</M> and <M>j</M> in different bicomponents are
    adjacent by a symmetric pair of edges if and only if
    the binary representation of <A>n</A> has a 1 in position
    (<M>j-i</M> modulo <M>m</M>) + 1 from the left. <P/>

    If the optional first argument <A>filt</A> is present, then this should
    specify the category or representation the digraph being created will
    belong to. For example, if <A>filt</A> is <Ref Filt="IsMutableDigraph"/>,
    then the digraph being created will be mutable, if <A>filt</A> is <Ref
    Filt="IsImmutableDigraph"/>, then the digraph will be immutable.
    If the optional first argument <A>filt</A> is not present, then <Ref
      Filt="IsImmutableDigraph"/> is used by default.<P/>

<Example><![CDATA[
gap> HaarGraph(3);
<immutable bipartite vertex-transitive symmetric digraph with bicompon\
ent sizes 2 and 2>
gap> D := HaarGraph(16);
<immutable bipartite vertex-transitive symmetric digraph with bicompon\
ent sizes 5 and 5>
]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="AndrasfaiGraph">
<ManSection>
  <Oper Name="AndrasfaiGraph" Arg="[filt, ]n"/>
  <Returns>A digraph.</Returns>
  <Description>
    If <A>n</A> is an integer greater than 0, then this operation returns the
    <M>n</M>th <E>Andrasfai graph</E>. The Andrasfai graph is a circulant graph
    with <M>3n - 1</M> vertices. The indices of the Andrasfai graph are given by
    the numbers between <M>1</M> and <M>3n - 1</M> that are congruent to
    <M>1 mod 3</M> (that is, for each index <M>j</M>, vertex <M>i</M> is
    adjacent to the <M>i + j</M>th and <M>i - j</M> vertices). The graph has
    <M>6(3n - 1)</M> edges. The graph is triangle free.<P/>

    As a circulant graph, the Andrasfai graph is biconnected, cyclic,
    Hamiltonian, regular, and vertex transitive.<P/>

    If the optional first argument <A>filt</A> is present, then this should
    specify the category or representation the digraph being created will
    belong to. For example, if <A>filt</A> is <Ref Filt="IsMutableDigraph"/>,
    then the digraph being created will be mutable, if <A>filt</A> is <Ref
    Filt="IsImmutableDigraph"/>, then the digraph will be immutable. 
    If the optional first argument <A>filt</A> is not present, then <Ref
    Filt="IsImmutableDigraph"/> is used by default.<P/>

    See <URL>https://mathworld.wolfram.com/OddGraph.html</URL> for further
    details. 

<Example><![CDATA[
gap> D := AndrasfaiGraph(4);
<immutable Hamiltonian biconnected vertex-transitive symmetric digraph\
 with 11 vertices, 44 edges>
gap> IsBiconnectedDigraph(D);
true
gap> IsIsomorphicDigraph(D, CirculantGraph(11, [1, 4, 7, 10]));
true]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="CirculantGraph">
<ManSection>
  <Oper Name="CirculantGraph" Arg="[filt, ]n, par"/>
  <Returns>A digraph.</Returns>
  <Description>
    If <A>n</A> is an integer greater than 1, and <A>par</A> is a list of
    integers that are contained in <M>[1 .. n]</M> then this operation returns
    a <E>circulant graph</E>. The circulant graph is a graph on <A>n</A>
    vertices, where for each element <M>j</M> of <A>par</A>, the <M>i</M>th 
    vertex is adjacent to the <M>(i + j)</M>th and <M>(i - j)</M>th
    vertices.<P/>

    If <A>par</A> is <M>[1]</M>, then the graph is the <M>n</M>th cyclic graph.
    If <A>par</A> is <M>[1, 2, . . ., Int(n / 2)]</M>, then the graph is the 
    complete graph on <A>n</A> vertices. If <A>n</A> is at least 4 and
    <A>par</A> is <M>[1, n]</M> then the graph is the <M>n</M>th Mobius ladder
    graph.<P/>

    A circulant graph is biconnected, cyclic, Hamiltonian, regular, and vertex
    transitive.<P/>

    If the optional first argument <A>filt</A> is present, then this should
    specify the category or representation the digraph being created will
    belong to. For example, if <A>filt</A> is <Ref Filt="IsMutableDigraph"/>,
    then the digraph being created will be mutable, if <A>filt</A> is <Ref
    Filt="IsImmutableDigraph"/>, then the digraph will be immutable. 
    If the optional first argument <A>filt</A> is not present, then <Ref
    Filt="IsImmutableDigraph"/> is used by default.<P/>

    See <URL>https://mathworld.wolfram.com/OddGraph.html</URL> for further
    details. 

<Example><![CDATA[
gap> D := CirculantGraph(6, [1, 2, 3]);
<immutable Hamiltonian biconnected vertex-transitive symmetric digraph\
 with 6 vertices, 30 edges>
gap> IsIsomorphicDigraph(D, CompleteDigraph(6));
true]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="BananaTree">
<ManSection>
  <Oper Name="BananaTree" Arg="[filt, ]n, k"/>
  <Returns>A digraph</Returns>
  <Description>
    If <A>n</A> and <A>k</A> are positive integers with <A>k</A> greater than <M>1</M>,
    then this operation returns the <E>banana tree</E>
    with parameters <A>n</A> and <A>k</A>, as defined below. <P/>

    From
    <URL>https://mathworld.wolfram.com/BananaTree.html</URL>:
    <P/>

    <Q>An <C>(<A>n</A>,<A>k</A>)</C>-banana tree,
    as defined by Chen et al. (1997), is a graph obtained by
    connecting one leaf of each of <A>n</A> copies of an <A>k</A>-star graph
    with a single root vertex that is distinct from all the stars.</Q>
    <P/>
    
    Specifically, in the resulting digraph, vertex <C>1</C> is the 'root',
    and for each <C>m</C> in <C>[1 .. <A>k</A>]</C>,
    the <C>m</C>th star is on the vertices
    <C>[((m - 1) * n) + 2 .. (m * n) + 1]</C>,
    with the first of these being the 'centre' of the star,
    and the second being the 'leaf' adjacent <C>1</C>. <P/>
    
    If the optional first argument <A>filt</A> is present, then this should
    specify the category or representation the digraph being created will
    belong to. For example, if <A>filt</A> is <Ref Filt="IsMutableDigraph"/>,
    then the digraph being created will be mutable, if <A>filt</A> is <Ref
    Filt="IsImmutableDigraph"/>, then the digraph will be immutable.
    If the optional first argument <A>filt</A> is not present, then <Ref
      Filt="IsImmutableDigraph"/> is used by default.<P/>

    See also <Ref Oper="StarDigraph"/> and <Ref Prop="IsUndirectedTree"/>.
<Example><![CDATA[
gap> D := BananaTree(2, 4);
<immutable undirected tree digraph with 9 vertices>
gap> D := BananaTree(3, 3);
<immutable undirected tree digraph with 10 vertices>
gap> D := BananaTree(5, 2);
<immutable undirected tree digraph with 11 vertices>
gap> D := BananaTree(3, 4);
<immutable undirected tree digraph with 13 vertices>
]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="KellerGraph">
<ManSection>
  <Oper Name="KellerGraph" Arg="[filt, ]n"/>
  <Returns>A digraph.</Returns>
  <Description>
    If <A>n</A> is an integer at least 0 then this operation returns the
    <M>n</M>th or <M>n</M>-dimensional <E>Keller graph</E>. The graph has
    vertices given by the <M>n</M>-tuples on the set <M>[0, 1, 2, 3]</M>.
    Two vertices are adjacent if their respective tuples are such that they
    differ in at least two coordinates and in at least one coordinate the
    difference between the two is <M>2 mod 4</M>. The Keller graph has
    <M>4 ^ n</M> vertices.<P/>

    The Keller graphs were constructed with the intention of finding
    counterexamples to Keller's conjecture
    (<URL>https://mathworld.wolfram.com/KellersConjecture.html</URL>), and has
    been used since for testing maximum clique algorithms.<P/>

    If <M>n</M> is 1 then the graph is empty, for <M>n</M> greater than 1 the
    chromatic number of the Keller graph is <M>2^n</M> and the graph is 
    Hamiltonian.<P/>

    If the optional first argument <A>filt</A> is present, then this should
    specify the category or representation the digraph being created will
    belong to. For example, if <A>filt</A> is <Ref Filt="IsMutableDigraph"/>,
    then the digraph being created will be mutable, if <A>filt</A> is <Ref
    Filt="IsImmutableDigraph"/>, then the digraph will be immutable. 
    If the optional first argument <A>filt</A> is not present, then <Ref
    Filt="IsImmutableDigraph"/> is used by default.<P/>

    See <URL>https://mathworld.wolfram.com/KellerGraph.html</URL> for further
    details. 

<Example><![CDATA[
gap> D := KellerGraph(3);
<immutable Hamiltonian connected symmetric digraph with 64 vertices, 2\
176 edges>
gap> ChromaticNumber(D);
8]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="PermutationStarGraph">
<ManSection>
  <Oper Name="PermutationStarGraph" Arg="[filt, ]n, k"/>
  <Returns>A digraph.</Returns>
  <Description>
    If <A>n</A> is an integer at greater than 0 and <A>k</A> is an integer
    greater than 1, and <A>k</A> less than or equal to <A>n</A>, then this
    operation returns the <M>(n, k)</M>th <E>permutation Star graph</E>. The
    vertices of the graph are given by the <M>k</M>-length ordered subsets of
    an <M>n</M>-set, with two vertices being adjacent if one is labelled
    <M>p1 p2 p3 ... pi ... pk</M>, and the other is either labelled
    <M>pi p2 p3 ... p1 ... pk</M>, or labelled <M>x p2 p3 ... pi ... pk</M>
    where <M>x</M> is in <M>[1 .. n]</M> and is not equal to <M>p1</M>. The
    graph has <M>n! / (n - k)!</M> vertices.<P/>

    The permutation star graph is regular and vertex transitive. It has diameter
    <M>2k - 1</M> if <A>k</A> less than or equal to <M>Int(n / 2)</M>, and
    diameter <M>Int((n - 1) / 2) + k</M> if <M><A>k</A> >= Int(n / 2) + 1</M>.
    <P/>

    If the optional first argument <A>filt</A> is present, then this should
    specify the category or representation the digraph being created will
    belong to. For example, if <A>filt</A> is <Ref Filt="IsMutableDigraph"/>,
    then the digraph being created will be mutable, if <A>filt</A> is <Ref
    Filt="IsImmutableDigraph"/>, then the digraph will be immutable. 
    If the optional first argument <A>filt</A> is not present, then <Ref
    Filt="IsImmutableDigraph"/> is used by default.<P/>

    See <URL>https://mathworld.wolfram.com/PermutationStarGraph.html</URL> for
    further details. 

<Example><![CDATA[
gap> D := PermutationStarGraph(6, 2);
<immutable vertex-transitive symmetric digraph with 30 vertices, 150 e\
dges>
gap> DigraphDiameter(D);
3]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="TadpoleDigraph">
<ManSection>
  <Oper Name="TadpoleDigraph" Arg="[filt, ]m, n"/>
  <Returns>A digraph.</Returns>
  <Description>
    The <E>Tadpole digraph</E> is the symmetric closure of the disjoint union
    of the cycle digraph on <C>[1..<A>m</A>]</C> (the 'head' of the tadpole)
    and the chain digraph on <C>[<A>m</A>+1..<A>m</A>+<A>n</A>]</C>
    (the 'tail' of the tadpole), along with the additional
    edges <C>[1, <A>m</A>+1]</C> and <C>[1, <A>m</A>+1]</C>
    which connect the 'head' and the 'tail'. For more details on the Tadpole digraph
    please refer to <URL>https://en.wikipedia.org/wiki/Tadpole_graph</URL>.<P/>

    See <Ref Oper="DigraphSymmetricClosure"/>,
    <Ref Func="DigraphDisjointUnion" Label="for a list of digraphs"/>,
    <Ref Oper="CycleDigraph"/>, and <Ref Oper="ChainDigraph"/>. <P/>

    If the optional first argument <A>filt</A> is present, then this should
    specify the category or representation the digraph being created will
    belong to. For example, if <A>filt</A> is <Ref Filt="IsMutableDigraph"/>,
    then the digraph being created will be mutable, if <A>filt</A> is <Ref
    Filt="IsImmutableDigraph"/>, then the digraph will be immutable. 
    If the optional first argument <A>filt</A> is not present, then <Ref
      Filt="IsImmutableDigraph"/> is used by default.<P/>

    <Example><![CDATA[
gap> TadpoleDigraph(10, 15);
<immutable symmetric digraph with 25 vertices, 50 edges>
gap> TadpoleDigraph(IsMutableDigraph, 5, 6);
<mutable digraph with 11 vertices, 22 edges>
gap> IsSymmetricDigraph(TadpoleDigraph(3, 5));
true
]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="WindmillGraph">
<ManSection>
  <Oper Name="WindmillGraph" Arg="[filt, ]n, m"/>
  <Returns>A digraph.</Returns>
  <Description>
    If <A>n</A> and <A>m</A> are integers greater than 1 then this operation
    returns the <M>(n, m)</M>th <E>windmill graph</E>. The windmill graph is 
    formed from <M>m</M> copies of the complete graph on <M>n</M> vertices with 
    one shared vertex. The graph has <M>(n - 1) * m + 1</M> vertices and 
    <M>m * n * (n - 1) / 2</M> undirected edges. The windmill graph has
    chromatic number <M>n</M> and diameter 2.<P/>

    If the optional first argument <A>filt</A> is present, then this should
    specify the category or representation the digraph being created will
    belong to. For example, if <A>filt</A> is <Ref Filt="IsMutableDigraph"/>,
    then the digraph being created will be mutable, if <A>filt</A> is <Ref
    Filt="IsImmutableDigraph"/>, then the digraph will be immutable. 
    If the optional first argument <A>filt</A> is not present, then <Ref
    Filt="IsImmutableDigraph"/> is used by default.<P/>

    See <URL>https://mathworld.wolfram.com/WindmillGraph.html</URL> for
    further details. 

<Example><![CDATA[
gap> D := WindmillGraph(4, 3);
<immutable symmetric digraph with 10 vertices, 36 edges>
gap> ChromaticNumber(D);
4]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="StackedPrismGraph">
<ManSection>
  <Oper Name="StackedPrismGraph" Arg="[filt, ]n, k"/>
  <Returns>A digraph.</Returns>
  <Description>
    If <A>n</A> is an integer at least 3 and <A>k</A> is a positive integer then
     this operation returns the <M>(n, k)</M>th <E>stacked prism graph</E>. The 
     graph is <M>k</M> concentric <M>n</M>-Cycle graphs connected by spokes.
     The stacked prism is the graph Cartesian product of the <M>n</M>th cycle 
     graph and the <M>k</M>th path graph. The graph has <M>nk</M> vertices and 
     <M>n(2k - 1)</M> undirected edges. If <M>k</M> is 1 then the graph is the 
     <M>n</M>th cycle graph, if <M>k</M> is 2 then the graph is the prism graph.
     <P/>

    If the optional first argument <A>filt</A> is present, then this should
    specify the category or representation the digraph being created will
    belong to. For example, if <A>filt</A> is <Ref Filt="IsMutableDigraph"/>,
    then the digraph being created will be mutable, if <A>filt</A> is <Ref
    Filt="IsImmutableDigraph"/>, then the digraph will be immutable. 
    If the optional first argument <A>filt</A> is not present, then <Ref
    Filt="IsImmutableDigraph"/> is used by default.<P/>

    See <URL>https://mathworld.wolfram.com/StackedPrismGraph.html</URL> for
    further details. 

<Example><![CDATA[
gap> D := StackedPrismGraph(5, 2);
<immutable symmetric digraph with 10 vertices, 30 edges>
gap> IsIsomorphicDigraph(D, PrismGraph(5));
true]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="BookDigraph">
<ManSection>
  <Oper Name="BookDigraph" Arg="[filt, ]m"/>
  <Returns>A digraph.</Returns>
  <Description>
    The <E>Book digraph</E> is the Cartesian product of a complete digraph with 2 vertices
    (as the "Book Spine") and the <M><A>m</A>+1</M> star digraph (as the "Pages").
    For more details on the Book digraph please refer to <URL>https://mathworld.wolfram.com/BookGraph.html</URL>.<P/>

    See <Ref Func="DigraphCartesianProduct" Label="for a positive number of digraphs"/>,
    <Ref Oper="CompleteDigraph"/>, and <Ref Oper="StarDigraph"/>. <P/>

    If the optional first argument <A>filt</A> is present, then this should
    specify the category or representation the digraph being created will
    belong to. For example, if <A>filt</A> is <Ref Filt="IsMutableDigraph"/>,
    then the digraph being created will be mutable, if <A>filt</A> is <Ref
    Filt="IsImmutableDigraph"/>, then the digraph will be immutable. 
    If the optional first argument <A>filt</A> is not present, then <Ref
      Filt="IsImmutableDigraph"/> is used by default.<P/>

    <Example><![CDATA[
gap> BookDigraph(1);
<immutable bipartite symmetric digraph with bicomponent sizes 2 and 2>
gap> BookDigraph(2);
<immutable bipartite symmetric digraph with bicomponent sizes 3 and 3>
gap> BookDigraph(IsMutable, 12);
<mutable digraph with 26 vertices, 74 edges>
gap> BookDigraph(7);
<immutable bipartite symmetric digraph with bicomponent sizes 8 and 8>
gap> IsSymmetricDigraph(BookDigraph(24));
true
gap> IsBipartiteDigraph(BookDigraph(24));
true
]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="WebGraph">
<ManSection>
  <Oper Name="WebGraph" Arg="[filt, ]n"/>
  <Returns>A digraph.</Returns>
  <Description>
    If <A>n</A> is an integer at least 3 then this operation returns the
    <M>n</M>th <E>web graph</E>. The web graph is the <M>(n, 3)</M>th 
    stacked prism graph with the edges of the outer cycle removed. The graph 
    has <M>3n</M> vertices and <M>4n</M> undirected edges.<P/>

    If the optional first argument <A>filt</A> is present, then this should
    specify the category or representation the digraph being created will
    belong to. For example, if <A>filt</A> is <Ref Filt="IsMutableDigraph"/>,
    then the digraph being created will be mutable, if <A>filt</A> is <Ref
    Filt="IsImmutableDigraph"/>, then the digraph will be immutable. 
    If the optional first argument <A>filt</A> is not present, then <Ref
    Filt="IsImmutableDigraph"/> is used by default.<P/>

    See <URL>https://mathworld.wolfram.com/WebGraph.html</URL> for
    further details. 

<Example><![CDATA[
gap> D := WebGraph(5);
<immutable symmetric digraph with 15 vertices, 40 edges>]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="HanoiGraph">
<ManSection>
  <Oper Name="HanoiGraph" Arg="[filt, ]n"/>
  <Returns>A digraph.</Returns>
  <Description>
    If <A>n</A> is positive integer then this operation returns the <M>n</M>th
    <E>Hanoi graph</E>. The Hanoi graph's vertices represent the possible states
     of the 'Tower of Hanoi' puzzle on three 'towers', while its edges represent
     possible moves. The Hanoi graph has <M>3^n</M> vertices, and
     <M>(1/2) * Binomial(3, 3) * (3^n - 1)</M> undirected edges.<P/>

    The Hanoi graph is Hamiltonian. The graph superficially resembles the 
    Sierpinski triangle. The graph is also a 'penny graph' - a graph whose 
    vertices can be considered to be non-overlapping unit circles on a flat
    surface, with two vertices adjacent only if the unit circles touch at a
    single point. Thus the Hanoi graph is planar.<P/>

    If the optional first argument <A>filt</A> is present, then this should
    specify the category or representation the digraph being created will
    belong to. For example, if <A>filt</A> is <Ref Filt="IsMutableDigraph"/>,
    then the digraph being created will be mutable, if <A>filt</A> is <Ref
    Filt="IsImmutableDigraph"/>, then the digraph will be immutable. 
    If the optional first argument <A>filt</A> is not present, then <Ref
    Filt="IsImmutableDigraph"/> is used by default.<P/>

    See <URL>https://mathworld.wolfram.com/HanoiGraph.html</URL> for
    further details. 

<Example><![CDATA[
gap> D := HanoiGraph(5);
<immutable Hamiltonian connected symmetric digraph with 243 vertices, \
726 edges>
gap> IsPlanarDigraph(D);
true]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="BondyGraph">
<ManSection>
  <Oper Name="BondyGraph" Arg="[filt, ]n"/>
  <Returns>A digraph.</Returns>
  <Description>
    If <A>n</A> is a non-negative integer then this operation returns the
    <M>n</M>th <E>Bondy graph</E>. The Bondy graphs are a family of
    hypohamiltonian graphs: a graph which is not Hamiltonian itself but the 
    removal of any vertex produces a Hamiltonian graph. The Bondy graphs are 
    the <M>(3 * (2 * n + 1) + 2, 2)</M>th Generalised Petersen graphs, and have 
    <M>12n + 10</M> vertices and <M>15 + 18n</M> undirected edges.<P/>

    If the optional first argument <A>filt</A> is present, then this should
    specify the category or representation the digraph being created will
    belong to. For example, if <A>filt</A> is <Ref Filt="IsMutableDigraph"/>,
    then the digraph being created will be mutable, if <A>filt</A> is <Ref
    Filt="IsImmutableDigraph"/>, then the digraph will be immutable. 
    If the optional first argument <A>filt</A> is not present, then <Ref
    Filt="IsImmutableDigraph"/> is used by default.<P/>

    See <URL>https://mathworld.wolfram.com/HypohamiltonianGraph.html</URL> for
    further details. 

<Example><![CDATA[
gap> D := BondyGraph(1);
<immutable symmetric digraph with 22 vertices, 66 edges>
gap> IsHamiltonianDigraph(D);
false
gap> G := List([1 .. 22], x -> DigraphRemoveVertex(D, x));;
gap> ForAll(G, x -> IsHamiltonianDigraph(x));
true]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="BinomialTreeGraph">
<ManSection>
  <Oper Name="BinomialTreeGraph" Arg="[filt, ]n"/>
  <Returns>A digraph.</Returns>
  <Description>
    If <A>n</A> is a positive integer then this operation returns the
    <M>n</M>th <E>binomial tree graph</E>. The binomial tree graph has <M>n</M>
    vertices and <M>n-1</M> undirected edges. The vertices of the binomial tree 
    graph are the numbers from 1 to <M>n</M> in binary representation, with a 
    vertex <M>v</M> having as a direct parent the vertex with binary
    representation the same as <M>v</M> but with the lowest 1-bit cleared. For 
    example, the vertex <M>011</M> has parent <M>010</M>, and the vertex
    <M>010</M> has parent <M>000</M>.<P/>

    The binomial tree graph is an undirected tree, and is symmetric as a
    digraph.<P/>

    If the optional first argument <A>filt</A> is present, then this should
    specify the category or representation the digraph being created will
    belong to. For example, if <A>filt</A> is <Ref Filt="IsMutableDigraph"/>,
    then the digraph being created will be mutable, if <A>filt</A> is <Ref
    Filt="IsImmutableDigraph"/>, then the digraph will be immutable. 
    If the optional first argument <A>filt</A> is not present, then <Ref
    Filt="IsImmutableDigraph"/> is used by default.<P/>

    See <URL>https://metacpan.org/pod/Graph::Maker::BinomialTree</URL> for
    further details. 

<Example><![CDATA[
gap> D := BinomialTreeGraph(9);
<immutable undirected tree digraph with 9 vertices>]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="CycleGraph">
<ManSection>
  <Oper Name="CycleGraph" Arg="[filt, ]n"/>
  <Returns>A digraph.</Returns>
  <Description>
    If <A>n</A> is an integer greater than 2 then this operation returns the
    <M>n</M>th <E>cycle graph</E>, consisting of the cycle on <M>n</M> vertices.
    The cycle graph, unlike the cycle digraph, is symmetric. The cycle graph 
    has <M>n</M> vertices and <M>n</M> undirected edges. The cycle graph is 
    simple so the non-simple graphs with a single vertex and single loop and
    with two vertices and two edges between them are excluded.<P/>

    If the optional first argument <A>filt</A> is present, then this should
    specify the category or representation the digraph being created will
    belong to. For example, if <A>filt</A> is <Ref Filt="IsMutableDigraph"/>,
    then the digraph being created will be mutable, if <A>filt</A> is <Ref
    Filt="IsImmutableDigraph"/>, then the digraph will be immutable. 
    If the optional first argument <A>filt</A> is not present, then <Ref
    Filt="IsImmutableDigraph"/> is used by default.<P/>

    See <URL>https://mathworld.wolfram.com/CycleGraph.html</URL> for
    further details. 

<Example><![CDATA[
gap> D := CycleGraph(7);
<immutable symmetric digraph with 7 vertices, 14 edges>]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="PathGraph">
<ManSection>
  <Oper Name="PathGraph" Arg="[filt, ]n"/>
  <Returns>A digraph.</Returns>
  <Description>
    If <A>n</A> is a non-negative integer then this operation returns the
    <M>n</M>th <E>path graph</E>, consisting of the path on <M>n</M> vertices.
    This is similar to the Chain digraph but with symmetric edges. The path 
    graph has <M>n</M> vertices and <M>n-1</M> edges. The graph is an 
    undirected tree.<P/>

    If the optional first argument <A>filt</A> is present, then this should
    specify the category or representation the digraph being created will
    belong to. For example, if <A>filt</A> is <Ref Filt="IsMutableDigraph"/>,
    then the digraph being created will be mutable, if <A>filt</A> is <Ref
    Filt="IsImmutableDigraph"/>, then the digraph will be immutable. 
    If the optional first argument <A>filt</A> is not present, then <Ref
    Filt="IsImmutableDigraph"/> is used by default.<P/>

    See <URL>https://mathworld.wolfram.com/PathGraph.html</URL> for
    further details. 

<Example><![CDATA[
gap> D := PathGraph(12);
<immutable undirected tree digraph with 12 vertices>]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>

<#GAPDoc Label="HelmGraph">
<ManSection>
  <Oper Name="HelmGraph" Arg="[filt, ]n"/>
  <Returns>A digraph.</Returns>
  <Description>
    If <A>n</A> is a positive integer at least 3, then this operation returns
    the <M>n</M>th <E>helm graph</E>. The helm graph is the <A>n</A>-1th wheel 
    graph with, for each external vertex of the 'wheel', adjoining a new vertex 
    incident only to the first vertex. That is, the graph looks similar to 
    a ship's helm.<P/>

    If the optional first argument <A>filt</A> is present, then this should
    specify the category or representation the digraph being created will
    belong to. For example, if <A>filt</A> is <Ref Filt="IsMutableDigraph"/>,
    then the digraph being created will be mutable, if <A>filt</A> is <Ref
    Filt="IsImmutableDigraph"/>, then the digraph will be immutable. 
    If the optional first argument <A>filt</A> is not present, then <Ref
    Filt="IsImmutableDigraph"/> is used by default.<P/>

    See <URL>https://mathworld.wolfram.com/WheelGraph.html</URL> for further
    details. 

<Example><![CDATA[
gap> D := HelmGraph(4);
<immutable symmetric digraph with 9 vertices, 24 edges>]]></Example>
  </Description>
</ManSection>
<#/GAPDoc>